<a href="https://colab.research.google.com/github/Elwing-Chou/ximen1129/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [16]:
from urllib.request import urlretrieve
url = "https://github.com/Elwing-Chou/ximen1129/raw/main/train.csv"
urlretrieve(url, "train.csv")
url = "https://github.com/Elwing-Chou/ximen1129/raw/main/test.csv"
urlretrieve(url, "test.csv")

('test.csv', <http.client.HTTPMessage at 0x7f959e9c30d0>)

In [17]:
import pandas as pd
train = pd.read_csv("train.csv", encoding="utf-8")
test = pd.read_csv("test.csv", encoding="utf-8")

In [18]:
datas = pd.concat([train, test], axis=0, ignore_index=True)
datas = datas.drop(["PassengerId", "Survived"], axis=1)

In [19]:
b = int
b(5.2)

5

In [20]:
def add(n1, n2, d=2):
    new = round(n1 + n2, d)
    return new
print(add(3.12323, 5.123132))
print(add(3.12323, 5.123132, d=5))

8.25
8.24636

In [21]:
def test():
    return add
test()(3.123, 5)

8.12

In [22]:
# demo
name = "Braund, Mr. Owen Harris"
name.split(",")[-1].split(".")[0].strip()

'Mr'

In [23]:
# Series.apply: 對整行執行同一個操作
def nameflow(name):
    return name.split(",")[-1].split(".")[0].strip()
# nameflow("Braund, Mr. Owen Harris")
datas["Name"] = datas["Name"].apply(nameflow)
datas

      Pclass    Name     Sex   Age  ...              Ticket      Fare Cabin  Embarked
0          3      Mr    male  22.0  ...           A/5 21171    7.2500   NaN         S
1          1     Mrs  female  38.0  ...            PC 17599   71.2833   C85         C
2          3    Miss  female  26.0  ...    STON/O2. 3101282    7.9250   NaN         S
3          1     Mrs  female  35.0  ...              113803   53.1000  C123         S
4          3      Mr    male  35.0  ...              373450    8.0500   NaN         S
...      ...     ...     ...   ...  ...                 ...       ...   ...       ...
1304       3      Mr    male   NaN  ...           A.5. 3236    8.0500   NaN         S
1305       1    Dona  female  39.0  ...            PC 17758  108.9000  C105         C
1306       3      Mr    male  38.5  ...  SOTON/O.Q. 3101262    7.2500   NaN         S
1307       3      Mr    male   NaN  ...              359309    8.0500   NaN         S
1308       3  Master    male   NaN  ...                2668   22.3583   NaN         C

[1309 rows x 10 columns]

In [24]:
def cabinflow(cabin):
    if pd.isna(cabin):
        return cabin
    else:
        return cabin[0]
datas["Cabin"] = datas["Cabin"].apply(cabinflow)
datas["Cabin"].value_counts()

C    94
B    65
D    46
E    41
A    22
F    21
G     5
T     1
Name: Cabin, dtype: int64

In [27]:
dic = datas["Ticket"].value_counts()
def ticketflow(ticket):
    if pd.isna(ticket):
        return ticket
    else:
        return dic[ticket]
datas["Ticket"] = datas["Ticket"].apply(ticketflow)

In [37]:
s = datas.isna().sum()
# pandas: dataframe/series[跟你資料筆數一樣多的一個t/f list]
s[s != 0].sort_values(ascending=False)

Cabin       1014
Age          263
Embarked       2
Fare           1
dtype: int64

In [41]:
# filter的實驗
df = pd.DataFrame([
 [1, 2],
 [3, 4]     
])
df[[True, True]]

   0  1
0  1  2
1  3  4